Table of Contents
 Interface IIdeaPersistentObject
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
An object that can be recreated at any point by its persistence Token.
public interface IIdeaPersistentObject : IIdeaObject
Inherited Members
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 Token
Persistence token. Holds data neccessery to recreated the object in future.
IIdeaPersistenceToken Token { get; }
Property Value
IIdeaPersistenceToken
 Edit this page